app/views/tweets/_profile.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 2]]
---
            <p class="heading">Tweets</p>
            <p class="title is-6"><%= current_user.tweets.count %></p>