app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("created_at DESC")
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC

  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "me tweet"], ["created_at", "2020-01-29 21:51:17.198502"], ["updated_at", "2020-01-29 21:51:17.198502"], ["user_id", 2]]